Revit 2027 API
ProjectPosition.EastWest Property
 East/West offset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EastWest { get; set; }
Public Property EastWest As Double
	Get
	Set
public:
property double EastWest {
	double get ();
	void set (double value);
}
member EastWest : float with get, set
Property Value
Double
Remarks
 The offset of the project location from the site location in the east/west direction. Measured in decimal feet.
See Also
Reference
ProjectPosition Class
Autodesk.Revit.DB Namespace